
## Plan Result




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.idam-testing-support-api-db[0].azurerm_resource_group.data-resourcegroup
  * module.idam-testing-support-api-db[0].azurerm_template_deployment.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.idam-testing-support-api-db[0].data.azurerm_postgresql_server.replica will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_postgresql_server" "replica"  {
      ~ administrator_login = "idamtstsptapi" -> (known after apply)
      ~ fqdn                = "idam-testing-support-api-idam-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-testing-support-api-data-idam-aat/providers/Microsoft.DBforPostgreSQL/servers/idam-testing-support-api-idam-aat" -> (known after apply)
      ~ identity            = [] -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "idam-testing-support-api-idam-aat"
      ~ sku_name            = "GP_Gen5_4" -> (known after apply)
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/idam-testing-support-api.git"
          - "Team Name"           = "IdAM"
          - "application"         = "idam-testing-support-api"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "idam-team"
          - "environment"         = "staging"
          - "managedBy"           = "idam"
        } -> (known after apply)
      ~ version             = "11" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.idam-testing-support-api-db[0].azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-testing-support-api-data-idam-aat"
        name     = "idam-testing-support-api-data-idam-aat"
      ~ tags     = {
          - "Team Name"           = "IdAM" -> null
          ~ "application"         = "idam-testing-support-api" -> "cft-idam"
          ~ "contactSlackChannel" = "idam-team" -> "#idam-support-cft"
          ~ "managedBy"           = "idam" -> "IdAM"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.idam-testing-support-api-db[0].azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-testing-support-api-data-idam-aat/providers/Microsoft.Resources/deployments/idam-testing-support-api-idam-aat"
        name                = "idam-testing-support-api-idam-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvaWRhbS10ZXN0aW5nLXN1cHBvcnQtYXBpLmdpdCIsIlRlYW0gTmFtZSI6IklkQU0iLCJhcHBsaWNhdGlvbiI6ImlkYW0tdGVzdGluZy1zdXBwb3J0LWFwaSIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiJpZGFtLXRlYW0iLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJpZGFtIn0=" -> "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvaWRhbS10ZXN0aW5nLXN1cHBvcnQtYXBpLmdpdCIsImFwcGxpY2F0aW9uIjoiY2Z0LWlkYW0iLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2lkYW0tc3VwcG9ydC1jZnQiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJJZEFNIn0="
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":153,"Program":"tfcmt","SHA1":"","Vars":{}} -->